Repository: 84000/data-translation-memory
Catalog: Toh_144-Cultivating_Trust_in_the_Great_Vehicle-v.2.tmx
Source language: bo
Languages: en

source: ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་འབྲིང་བ་ལ་བརྟེན་ནས་ཆེན་པོ་ཐོབ་པར་འགྱུར་ཏེ།
en: This mediocre trust in the Great Vehicle that allows one to accomplish the Great Vehicle in turn produces a great degree of trust.

source: དད་པ་དེས་དད་པའི་ཤས་ཆེན་པོ་ཐོབ་ནས་
en: Finally, this great trust turns into a most powerful form of trust.

source: དད་པ་མང་དུ་གནས་པ་འདི་ནི་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་འདྲིས་པ་ལས་སྐྱེ་བའོ། །
en: Noble son, this sustained engagement is how bodhisattvas engender trust in the Great Vehicle that allows them to accomplish the Great Vehicle by means of familiarity.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ཡོངས་སུ་མི་སྐྱོ་བ་ལས་སྐྱེ་བ་གང་ལགས།
en: “Blessed One, how does absence of weariness develop the bodhisattvas’ trust in the Great Vehicle that allows them to accomplish the Great Vehicle?”

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་དད་པ་ཤས་ཆེན་པོ་རྙེད་ནས་ཡོངས་སུ་སྐྱོ་བར་མི་འགྱུར་ཏེ
en: “Noble son, once bodhisattvas have obtained such ultrapowerful trust, they no longer feel weary.

source: རྒྱུན་མི་འཆད་པར་དགེ་བའི་ཕྱོགས་ལ་སྦྱོར་བའི་བར་དུ་ཡོངས་སུ་མི་སྐྱོ།
en: As they continuously apply themselves in virtue, they feel no sadness,

source: འཁོར་བའི་སྡུག་བསྔལ་གྱིས་ཡོངས་སུ་མི་སྐྱོ།
en: as the suffering of saṃsāra no longer causes them any sorrow.

source: སེམས་ཅན་ལོག་པར་ཞུགས་པ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་མི་སྐྱོ།
en: Likewise, misguided beings no longer make them sad,

source: བྱང་ཆུབ་སེམས་དཔའི་དཀའ་བ་སྤྱོད་པས་ཡོངས་སུ་མི་སྐྱོའོ། །
en: nor do the austerities of the bodhisattvas cause them any trouble.

source: དེ་དེ་ལྟར་ཡོངས་སུ་མི་སྐྱོ་བས་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་དགེ་བའི་བཤེས་གཉེན་རྣམས་མཉེས་པར་བྱེད་དེ། ཐེག་པ་ཆེན་པོ་ལ་དད་པའི་རྐྱེན་ཀྱང་རྙེད་དོ། །
en: Free from weariness in this way, they delight the buddhas, bodhisattvas, and their spiritual teachers, while their trust in the Great Vehicle continues to grow.

source: དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་སྐྱེད་ཅིང་སྦྱོར་བ་རྒྱུན་མི་གཅོད་དེ་སྦྱོར་བ་མ་བཏང་བ་ཡིན་ནོ། །
en: In this way, as their trust in the Great Vehicle is developed, they are able to persevere with a steady endeavor

source: དེས་ན་དེ་རྒྱུན་མི་ཆད་པར་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་དེ་འཇུག་སྟེ།
en: that further strengthens their trust in the Great Vehicle that allows them to accomplish the Great Vehicle.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ཡོངས་སུ་མི་སྐྱོ་བ་ལས་སྐྱེ་བའོ། །
en: This, noble son, is how bodhisattvas engender the trust in the Great Vehicle that allows them to accomplish the Great Vehicle through an absence of weariness.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ཡོངས་སུ་བསྐང་བ་ལས་སྐྱེ་བ་གང་ལགས།
en: “Blessed One, how does fulfillment develop the bodhisattvas’ trust in the Great Vehicle that allows them to accomplish the Great Vehicle?”

source: རིགས་ཀྱི་བུ་འདི་ལྟར་ཡོངས་སུ་མི་སྐྱོ་བར་སྦྱོར་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྒྱུན་དུ་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ཐོབ་པས་མྱུར་དུ་བསོད་ནམས་ཀྱི་ཚོགས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: “Noble son, when bodhisattvas are totally untiring in their engagement and have formed a steady trust in the Great Vehicle, they can quickly perfect the accumulations of merit and wisdom.

source: དེ་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་ཤིང་དགེ་བའི་རྩ་བས་ལེགས་པར་བརྟན་པས་
en: Since the accumulations of merit and wisdom have been perfected and are perfectly stable through their roots of virtue,

source: ཐེག་པ་ཆེན་པོ་ལ་དད་པའི་རྐྱེན་ཆུང་ངུས་ཀྱང་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་རྒྱ་ཆེན་པོ་སྐྱེ་ན
en: even a small circumstance for developing trust in the Great Vehicle can produce a deep faith in that vehicle,

source: ཐེག་པ་ཆེན་པོ་ལ་དད་པའི་རྐྱེན་རྒྱ་ཆེན་པོས་ལྟ་ཅི་སྨོས་ཏེ།
en: not to mention what a major circumstance for developing faith in the Great Vehicle can do.

source: དེ་ཉིན་མོའམ། མཚན་མོའམ། ཉལ་ལམ། མི་ཉལ་ཡང་རུང་། ཐེག་པ་ཆེན་པོ་ལ་དད་པའི་ཤུགས་ཀྱིས་དོན་མེད་པར་མི་འགྱུར་ཏེ།
en: Whether during the day or night, whether lying down or not, the force of faith in the Great Vehicle now ensures that their actions are never meaningless.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ཡོངས་སུ་བསྐང་བ་ལས་སྐྱེ་བའོ། །
en: This, noble son, is how bodhisattvas engender the trust in the Great Vehicle that allows them to accomplish the Great Vehicle through fulfillment.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་གནས་ལས་སྐྱེ་བ་གང་ལགས།
en: “Blessed One, how does composure develop the bodhisattvas’ trust in the Great Vehicle that allows them to accomplish the Great Vehicle?”

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པ་ནི་
en: “Noble son, bodhisattvas who have perfected the accumulations of merit and wisdom in this way

source: མྱུར་བ་མྱུར་བར་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དམིགས་ནས་
en: will soon turn their focus to the Great Vehicle so that they may accomplish the Great Vehicle.

source: དད་པ་དང་། མཆོག་ཏུ་དགའ་བ་ལས་བྱུང་བའི་སེམས་ཀྱི་ཏིང་ངེ་འཛིན་འཐོབ་སྟེ
en: In doing so, they attain a meditative absorption that is caused by faith and great joy.

source: མཉམ་པར་བཞག་པའི་སེམས་དེས་ཐེག་པ་ཆེན་པོའི་ཆོས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྟོན་ཏོ། །
en: Resting in equipoise, they can now accurately teach the perfect Dharma of the Great Vehicle.

source: དེའི་ཕྱིར་དེ་མ་ལོག་པའི་རྣམ་པས་དང་བ་སྐྱེ་ཞིང་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ཆེས་ཁྱད་པར་དུ་འཕགས་པ་སྐྱེའོ། །
en: This makes them genuinely inspired, and they develop a profound trust in the Great Vehicle that allows them to accomplish the Great Vehicle.

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་སེམས་ཀྱི་ཏིང་ངེ་འཛིན་སྔ་མ་དང་ལྷག་མཐོང་འདི་ནི་ཞི་གནས་དང་། ལྷག་མཐོང་གིས་ཡོངས་སུ་ཟིན་པའི་རྣལ་འབྱོར་གྱི་ལམ་དུ་འགྱུར་རོ། །
en: The previous mental absorption of the bodhisattva coupled with this insight now becomes a practice that is fueled by tranquility and insight.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣལ་འབྱོར་གྱི་ལམ་འདི་ལ་བརྟེན་ནས་རིམ་གྱིས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཡང་དག་པར་སྒྲུབ་པར་འགྱུར་ཏེ།
en: Through this way of practicing, the bodhisattva gradually and genuinely accomplishes all qualities of the Buddha.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་གནས་ལས་སྐྱེ་བའོ། །
en: Noble son, this is how bodhisattvas engender the trust in the Great Vehicle that allows them to accomplish the Great Vehicle through composure.”

source: བྱང་ཆུབ་སེམས་དཔའ་དང་བ་ཐབས་ཆེན་གྱིས་གསོལ་པ། །
en: The bodhisattva Great Skillful Trust said,

source: ཞི་གནས་དང་ལྷག་མཐོང་གི་ལམ་འདི་བྱང་ཆུབ་སེམས་དཔའ་ཚོགས་བསགས་པ་རྣམས་ཀྱི་ལགས་སམ། འོན་ཏེ་ཚོགས་མ་བསགས་པ་རྣམས་ཀྱི་ཡང་ལགས།
en: does this path of tranquility and insight pertain only to those bodhisattvas who have gathered the accumulations, or does it also pertain to those who have not?

source: རིགས་ཀྱི་བུ་ཞི་གནས་དང་ལྷག་མཐོང་གི་ལམ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཚོགས་མ་བསགས་པ་རྣམས་ཀྱི་ཡང་ཡིན་པར་ངས་བཤད་དོ། །
en: “Noble son, I teach that the path of tranquility and insight also pertains to the bodhisattvas who have not yet gathered the accumulations.

source: རིགས་ཀྱི་བུ་འདི་ལྟར་སེམས་མཉམ་པར་བཞག་པ་ནི་མངོན་པར་རྟོགས་པ་དང་འཐུན་པ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པའི་ཕྱོགས་ཀྱི་ས་ལ་འཇུག་པ་ལ་ཉེ་བར་འགྱུར་ཏེ།
en: Noble son, resting in equipoise accords with direct realization and therefore brings one closer to the faultless state of a bodhisattva.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་གནས་ལས་སྐྱེ་བ་སྟེ།
en: This, noble son, is how bodhisattvas engender the trust in the Great Vehicle that allows them to accomplish the Great Vehicle by means of composure.

source: གནས་ནི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ། །
en: Here, ‘composure’ is synonymous with ‘absorption.’ ”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ཆོག་མི་ཤེས་པ་ལས་སྐྱེ་བ་གང་ལགས།
en: “Blessed One, how does insatiability develop the bodhisattvas’ trust in the Great Vehicle that allows them to accomplish the Great Vehicle?”

source: རིགས་ཀྱི་བུ་ཏིང་ངེ་འཛིན་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཞི་གནས་ཙམ་དང་། ཏིང་ངེ་འཛིན་གྱི་རོ་དེ་ཙམ་གྱིས་ཆོག་པར་མི་འཛིན་གྱི།
en: “Noble son, bodhisattvas who have attained absorption will not be content with mere tranquility and the mere taste of absorption.

source: ཏིང་ངེ་འཛིན་དེ་ཉིད་ལ་གནས་ནས་དེ་ཐེག་པ་ཆེན་པོའི་ཆོས་དེ་དག་ལ་བགྲང་ཞིང་འཇལ་ལ་དཔྱོད་ཅིང་སོ་སོར་རྟོག་སྟེ
en: Instead, after resting in absorption, they will gauge, evaluate, study, and analyze the Dharma of the Great Vehicle.

source: དེ་ལ་བགྲང་ཞིང་འཇལ་ལ་དཔྱོད་ཅིང་སོ་སོར་རྟོག་པའི་རྣམ་པའི་ལྷག་མཐོང་རབ་ཏུ་སྐྱེའོ། །
en: This is how insight is developed by means of gauging, evaluating, studying, and analyzing.

source: དེས་ན་དེ་ལྷག་མཐོང་དང་ལྷན་ཅིག་སོང་བའི་རྒྱུན་ཆུ་བོ་ལྟར་འབབ་ཅིང་རླབས་འབྱུང་བ།
en: In this way, the bodhisattva attains a continuous state of mind that is concurrent with insight and flows like a whitewater river.

source: མངོན་པར་རྟོགས་པ་དང་ཆེས་འཐུན་པ། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པའི་
en: It is a state that accords with direct realization and the faultless being of a bodhisattva.

source: ཕྱོགས་ཀྱི་མཆོག་གི་ས་ལ་འཇུག་པ། རབ་ཏུ་འདོད་དོ། །
en: This ground from which all supreme factors grow is the foremost state.

source: ཤེས་རབ་ལ་ཉེ་བར་མི་གནས་ན་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ཇི་ལྟར་ཡང་མི་སྐྱེའོ་ཞེས་ང་སྨྲའོ། །
en: Noble son, unless one has gained this knowledge, it is impossible to attain the bodhisattvas’ trust in the Great Vehicle by which one can accomplish the Great Vehicle.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཚོགས་མ་བསགས་ཀྱང་ཐེག་པ་ཆེན་པོའི་ཆོས་ཉན་ཏམ། སེམས་ཀྱང་རུང་སྟེ།
en: “Noble son, even though bodhisattvas have not gathered the accumulations, they can still hear and contemplate the teachings of the Great Vehicle.

source: ཞི་གནས་དང་ལྷག་མཐོང་ལ་གནས་ན་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་སྐྱེའོ། །
en: Whenever they abide in tranquility and insight, they will naturally develop the trust in the Great Vehicle that allows them to accomplish the Great Vehicle.

source: སེམས་རྩེ་གཅིག་ཏུ་མི་བྱེད་ཅིང་ཐེག་པ་ཆེན་པོའི་ཆོས་མི་འཛིན་ན་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་མི་སྐྱེའི།
en: However, if their minds are not one-pointed, and if they fail to retain the teachings of the Great Vehicle, they will not develop trust in the Great Vehicle.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་སྐྱེ་བ་དེ་ཐམས་ཅད་ནི་མི་གཡེང་བའི་སེམས་ཀྱིས་ཆོས་ཀྱི་དོན་ལ་རྟོག་པ་ལས་
en: Noble son, all bodhisattvas who develop the trust in the Great Vehicle that allows them to accomplish the Great Vehicle do so based on comprehending the meaning of the Dharma with an undistracted mind.

source: སྐྱེ་བར་རྣམ་གྲངས་འདིས་དེ་ལྟར་རིག་པར་བྱའོ། །
en: You should understand that this is the proper approach.”

source: བཅོམ་ལྡན་འདས་ཚོགས་བསགས་པའི་ས་པའི་རྣལ་འབྱོར་གྱི་ལམ་དང་། ཚོགས་མ་བསགས་པའི་ས་པའི་རྣལ་འབྱོར་གྱི་ལམ་ཁྱད་པར་ཅི་མཆིས།
en: “Blessed One, how do the ways of practice differ for someone who has already gathered the accumulations and someone who has not yet gathered them?”

source: རིགས་ཀྱི་བུ་ཚོགས་མ་བསགས་པའི་ས་པའི་རྣལ་འབྱོར་གྱི་ལམ་ནི་ས་དང་མི་ཉེ་བ་སྟེ།
en: “Noble son, the practice for those who have not yet gathered the accumulations does not come close to the practice of those who are on the levels.

source: ཇི་ལྟར་ཚོགས་བསགས་པའི་ས་པ་ལྟར་དེ་དེ་ལྟར་རྫོགས་པ་མ་ཡིན་ནོ། །
en: It is not as complete as the practice of someone who has already gathered the accumulations.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཚོགས་བསགས་པའི་ས་པའི་རྣལ་འབྱོར་གྱི་ལམ་གང་ཡིན་པ་ནི་ས་ལ་འཇུག་པ་དང་ཉེ་ཞིང་རྫོགས་པ་ཡིན་ཏེ།
en: Noble son, the practice of someone who has already gathered the accumulations approaches, merges with, and perfects the levels.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ཆོག་མི་ཤེས་པ་ལས་སྐྱེ་བའོ། །
en: This, noble son, is how bodhisattvas engender the trust in the Great Vehicle that allows them to accomplish the Great Vehicle by means of insatiability.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་རབ་ཏུ་དབེན་པ་ལས་སྐྱེ་བ་གང་ལགས།
en: “Blessed One, how does solitude develop the bodhisattvas’ trust in the Great Vehicle that allows them to accomplish the Great Vehicle?”

source: རིགས་ཀྱི་བུ་རྫོགས་པའི་རྣལ་འབྱོར་གྱི་ལམ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཁྱིམ་ན་གནས་པ་དང་རབ་ཏུ་བྱུང་བ་རྣམས་དང་འདྲེ་ཞིང་མི་གནས་ཀྱི།
en: “Noble son, bodhisattvas who attain the perfect way of practice should not mingle or cohabit with householders or with the ordained.

source: བས་མཐར་གནས་འཆའ་ཞིང་གནས་ཏེ
en: Instead, they should set up residence in remote areas.

source: དེ་དག་ན་གཅིག་པུ་རྒྱང་བསྲིངས་ཏེ་བག་ཡོད་པ་དང་། རྟུན་པ་དང་། རྒྱུན་དུ་གནས་སོ། །
en: Such individuals will stay alone, far from others, where they can practice continuously, aware and diligent.

source: དེ་ལྟར་རབ་ཏུ་དབེན་པར་གནས་པ་དེ་རྣལ་འབྱོར་གྱི་ལམ་དེ་ཉིད་ལ་གནས་ནས་ཐེག་པ་ཆེན་པོའི་ཆོས་རྣམས་ཡིད་ལ་བྱེད་པས་
en: Those who stay in solitude can do proper practice while remaining mindful of the teachings of the Great Vehicle.

source: བར་ཆད་མེད་པར་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་རབ་ཏུ་སྐྱེད་དོ། །
en: In that way, obstacles are eliminated and the trust in the Great Vehicle that allows them to accomplish the Great Vehicle is developed.

source: ཇི་ཙམ་དུ་ཉིན་མོ་དང་། མཚན་མོ་དེ་དང་། དེ་དག་འདས་པ་དང་། སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་དང་དེ་དག་འདས་ཤིང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཁྱད་པར་དུ་འགྲོའོ། །
en: They spend each moment, each instant and every period of every day and night, pursuing the qualities of the factors of awakening.

source: དེ་དེ་ལྟར་རབ་ཏུ་དབེན་པའི་རྣལ་འབྱོར་གྱི་ལམ་ལ་གནས་ནས་རིམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་བར་དུ་འགྱུར་ཏེ།
en: Through pursuing their practice in solitude, they gradually awaken to unsurpassed and perfect buddhahood.

source: དེ་གང་དུ་ཐབས་ཀྱི་ཁྱད་པར་གཞན་བཙལ་བར་བྱ་བ་མེད་དོ། །
en: Compared to this, there is no better method to be found anywhere.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་རབ་ཏུ་དབེན་པ་ལས་སྐྱེ་བའོ། །
en: This, noble son, this is how bodhisattvas engender the trust in the Great Vehicle that allows them to accomplish the Great Vehicle through solitude.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་སྟོན་པ་ཚད་མར་བགྱིས་པ་ལས་སྐྱེ་བ་གང་ལགས།
en: “Blessed One, how does determination that the teacher is genuine develop the bodhisattvas’ trust in the Great Vehicle that allows them to accomplish the Great Vehicle?”

source: རིགས་ཀྱི་བུ་དེ་ལྟར་རབ་ཏུ་དབེན་པའི་རྣལ་འབྱོར་གྱི་ལམ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཐེག་པ་ཆེན་པོའི་ཆོས་རྣམས་ཡིད་ལ་བྱེད་པས་
en: “Noble son, when bodhisattvas follow the way of practice in solitude while being mindful of the Dharma of the Great Vehicle,

source: གང་ཐེག་པ་ཆེན་པོའི་ཆོས་ཟབ་ཅིང་གསང་བ་བློས་མི་ཆུད་པ་དེ་ལ་
en: there are some who fail to understand the profound and secret Dharma of the Great Vehicle.

source: སྟོན་པ་ཉིད་ཚད་མར་བྱེད་དོ། །
en: Such people should then reflect on the authenticity of the teacher.

source: སྟོན་པ་ཉིད་ཚད་མར་བྱས་ནས་ཆོས་དེ་དག་ལ་མོས་སོ། །
en: Once the authenticity of the teacher has been verified, one will naturally be interested in his teachings.

source: དེ་ལྟར་ཚུལ་བཞིན་དུ་རབ་ཏུ་རྣམ་པར་འབྱེད་པས་བདག་གང་གི་ཚེ་སྟོན་པ་ལ་མོས་པར་མ་གྱུར་པ་དེའི་ཚེ་བདག་སྟོན་པས་བཤད་པའི་ཆོས་རྣམས་ལ་མོས་པར་མི་འགྱུར་ཏེ
en: Otherwise, if one analyzes things carefully in this manner but fails to become interested in me, the teacher, one will also not feel any interest in my teachings.

source: སྟོན་པའི་ཆེ་བ་ཉིད་ལ་མོས་པ་ཤིན་ཏུ་མ་རུང་བར་མ་བྱས་པར་རིག་ནས་སྟོན་པ་ལ་མོས་པ་འཇུག་པ་ཐེག་པ་ཆེན་པོའི་ཆོས་གསང་བ་དག་ལ་མོས་པ་འཇུག་གོ། །
en: “However, by understanding that devotion to the teacher’s qualities can save one from extreme danger, one will feel interest in the teacher and the secret teachings of the Great Vehicle.

source: བྱང་ཆུབ་སེམས་དཔའ་ཇི་ལྟ་ཇི་ལྟར་ཁོང་དུ་ཆུད་ཅིང་རྟོགས་ནས་ཐེག་པ་ཆེན་པོའི་ཆོས་ཟབ་ཅིང་གསང་བ་དེ་དག་ལ་དད་པ་ཐོབ་པ་
en: The bodhisattvas who understand and realize this correctly will gain faith in the profound and secret teachings of the Great Vehicle.

source: དེ་ལྟར་ཁོང་དུ་མ་ཆུད་ཅིང་མ་རྟོགས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་མོས་པའི་སྟོབས་བསྐྱེད་པས་ཆོས་དེ་དག་ལ་དད་པ་ཐོབ་སྟེ
en: Even if they do not understand and realize these teachings, such bodhisattvas will still gain a strong interest, which in turn will lead them to attain trust.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་སྟོན་པ་ཚད་མར་བྱས་པ་ལས་སྐྱེ་བའོ། །
en: This, nobles son, is how bodhisattvas engender the trust in the Great Vehicle that allows them to accomplish the Great Vehicle by determining that the teacher is genuine.”

source: དེ་ལྟར་སྐྱེ་བ་སྣ་ཚོགས་འདི་དག་གིས་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔས་ཐེག་པ་ཆེན་པོའི་ཆོས་གང་ཡིད་ལ་བགྱིས་ཏེབླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྒྲུབ་པར་བགྱི།
en: “Blessed One, which teaching of the Great Vehicle does a bodhisattva who has gained trust in the Great Vehicle in these ways contemplate in order to accomplish unsurpassed and completely perfect awakening?”

source: རིགས་ཀྱི་བུ་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔས་དཔག་ཏུ་མེད་པ་བཅུ་ཡིད་ལ་བྱས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྒྲུབ་པར་བྱའོ། །
en: “Noble son, a bodhisattva who has gained trust in the Great Vehicle will engage with ten limitless features in order to achieve unsurpassed and completely perfect awakening.

source: བཅུ་གང་ཞེ་ན།
en: What are those ten?

source: ཆོས་དཔག་ཏུ་མེད་པ་དང་། ཟབ་པ་དཔག་ཏུ་མེད་པ་དང་། བརྗོད་པ་དཔག་ཏུ་མེད་པ་དང་། ཚིག་རབ་ཏུ་དབྱེ་བ་དཔག་ཏུ་མེད་པ་དང་། སེམས་ཅན་དཔག་ཏུ་མེད་པ་དང་། རྗེས་སུ་གཟུང་བ་དཔག་ཏུ་མེད་པ་དང་། ཐབས་ལ་མཁས་པ་དཔག་ཏུ་མེད་པ་དང་། དཀོན་མཆོག་གི་ཆེ་བ་ཉིད་དཔག་ཏུ་མེད་པ་དང་། ཞིང་དཔག་ཏུ་མེད་པ་དང་། ལས་དཔག་ཏུ་མེད་པའོ། །
en: They are (1) the limitless Dharma, (2) limitless profundity, (3) limitless statements, (4) limitless terms, (5) limitless beings, (6) limitless safeguarding, (7) limitless methods, (8) limitless greatness of the Jewels, (9) limitless fields, and (10) limitless activity.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཆོས་དཔག་ཏུ་མེད་པ་ནི་གང་མདོ་དང་། དབྱངས་ཀྱི་བསྙད་པ་དང་། ལུང་བསྟན་པ་ལ་སོགས་པ་བསྟན་པའི་ཆོས་རྣམས་ཀྱི་སྡེ་སྣོད་དུ་གཏོགས་པ་དང་། དེའི་ཡན་ལག་ཏུ་གཏོགས་པ་རྣམས་ཀྱི་ཆོས་དཔག་ཏུ་མེད་པའོ། །
en: 1. “Noble son, ‘the limitless Dharma’ refers to all sections of the Dharma that are included in the teachings, such as the discourses, the songs, the scriptures, and all that is contained within their subdivisions. These are the limitless Dharma.

source: དེ་ལ་ཟབ་པ་དཔག་ཏུ་མེད་པ་ནི་གང་ཐེག་པ་ཆེན་པོ་ལ་གང་ཟག་ལ་བདག་མེད་པ་དང་། ཆོས་ལ་བདག་མེད་པ་དང་། སྟོང་པ་ཉིད་དང་། དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། མཚན་མ་མེད་པ་དང་། དོན་དམ་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་རྣམ་གྲངས་རྣམས་ཀྱིས་བསྟན་པ་ཚད་མེད་པ་དང་། དགོངས་པ་ལས་བྱུང་བ་དང་།
en: 2.“ ‘Limitless profundity’ refers to the limitless teachings that are expressed through the categories within the Great Vehicle, such as the selflessness of a person, the selflessness of phenomena, emptiness, suchness, the limit of reality, absence of characteristics, the ultimate, the realm of phenomena, and the manifestations that occur based on realization.

source: ཟབ་པ་བསྟན་པ་དཔག་ཏུ་མེད་པའོ། །
en: These are limitless profundity.

source: དེ་ལ་བརྗོད་པ་དཔག་ཏུ་མེད་པ་ནི་རིགས་ཀྱི་བུ་བརྗོད་པ་གང་དང་གང་གིས་སེམས་ཅན་དང་ཆོས་དང་། དོན་རྟོགས་པར་འགྱུར་བ་
en: 3.“ ‘Limitless statements,’ noble son, refers to any type of statement that causes one to better understand other beings, the Dharma, and the truth.

source: ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བའི་སེམས་ཅན་རྣམས་ལ་ཡང་ཇི་ཙམ་དུ་ཚིག་བརྗོད་པ་དེ་དང་།
en: Such statements also include words spoken to those beings who have taken birth as animals.

source: དེས་དོན་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་གསུང་བརྗོད་པ་རྣམས་དཔག་ཏུ་མེད་པར་འབྱུང་བའོ། །
en: In order to make the truth understood, the utterances of the thus-gone ones appear limitlessly.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཚིག་རབ་ཏུ་དབྱེ་བ་དཔག་ཏུ་མེད་པ་ནི་རིགས་ཀྱི་བུ་སེམས་ཅན་རྣམས་ལ་འདུལ་བའི་དབང་གི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་ཚིག་རབ་ཏུ་དབྱེ་བའི་སྒོ་མང་པོ་ཉེ་བར་སྟོན་ཅིང་།
en: 4.“ ‘Limitless terms,’ noble son, refers to the many designations employed by the Thus-Gone One in order to tame beings.

source: དོན་རེ་རེ་ལ་ཡང་ཚིག་རབ་ཏུ་དབྱེ་བ་ཚད་མེད་པ་དག་གིས་རྣམ་གྲངས་སུ་ཕྱེ་སྟེ་རབ་ཏུ་སྟོན་པའོ། །
en: For each point, limitless terms are used to describe and explain various categories.

source: དེ་ལ་སེམས་ཅན་དཔག་ཏུ་མེད་པ་ནི་གང་སྐྱེ་བའི་འཁོར་བ་ཐོག་མ་དང་། ཐ་མ་མེད་པ་དང་། ཀུན་ཏུ་རྒྱུག་པ་དང་། འཁོར་བའི་སྡུག་བསྔལ་གྱི་སྔོན་གྱི་མཐའ་མི་མངོན་པས་སེམས་ཅན་དཔག་ཏུ་མེད་དོ། །
en: 5.“ ‘Limitless beings’ refers to the endless beings who are born in beginningless and endless saṃsāra, always drifting about and with no apparent beginning to the sufferings they experience there.

source: དེ་ལ་རྗེས་སུ་གཟུང་བ་དཔག་ཏུ་མེད་པ་ནི་རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་འདི་ལྟ་སྟེ། གནོད་པ་ལས་ཡོངས་སུ་བསྐྱབ་པའི་རྗེས་སུ་གཟུང་བ་དང་། ངན་སོང་ལས་ཡོངས་སུ་བསྐྱབ་པའི་རྗེས་སུ་གཟུང་བ་དང་། འཇིག་ཚོགས་ལས་ཡོངས་སུ་བསྐྱབ་པའི་རྗེས་སུ་གཟུང་བ་དང་།
en: 6.“ ‘Limitless safeguarding,’ noble son, refers to the Thus-Gone One’s protection, since he shields others from harm, the lower realms, and personhood.

source: ཐེག་པས་ཡོངས་སུ་བསྐྱབ་པའི་རྗེས་སུ་གཟུང་བ་དང་། རྗེས་སུ་གཟུང་བ་ཚད་མེད་པས་སེམས་ཅན་ཚད་མེད་པ་དག་ལ་དུས་ཐམས་ཅད་དུ་ཉེ་བར་གནས་པའོ། །
en: It also refers to his protection through his body of teachings, as well as the limitless types of protection continuously offered to all the limitless beings.

source: དེ་ལ་ཐབས་ལ་མཁས་པ་དཔག་ཏུ་མེད་པ་ནི་ཐབས་ལ་མཁས་པ་གང་དང་གང་གིས་སེམས་ཅན་ཚད་མེད་པ་དག་འདུལ་བར་འགྱུར་བ་སྟེ།
en: 7.“ ‘Limitless methods’ refers to taming limitless beings through a variety of skillful methods.

source: ཡང་ན་རིགས་པ་ཡང་དག་པར་བསྟན་པས་སམ། ཡང་ན་བག་མེད་པ་ཡང་དག་པར་བསྐུལ་བས་སམ། ཡང་ན་ཞུམ་པ་གཟེངས་བསྟོད་པས་སམ། ཡང་ན་ཡང་དག་པར་བསྒྲུབ་པ་ཡང་དག་པར་དགའ་བར་བྱ་བས་སམ། ཡང་ན་ཚིག་དྲག་པོའི་སྦྱོར་བས་སམ། ཡང་ན་ཚིག་འཇམ་པོའི་སྦྱོར་བས་སམ། ཡང་ན་བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་ཀྱིས་ཆོས་དང་འཐུན་པ་ཉིད་ཀུན་ཏུ་བསྟན་པས་སམ། ཡང་ན་རྣམ་པར་དག་པར་སྐྱེ་བའི་ལུས་ཀུན་ཏུ་བསྟན་པས་སམ། ཡང་ན་རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པའི་ཆོ་འཕྲུལ་ཀུན་ཏུ་བསྟན་པས་སམ། ཡང་ན་ཀུན་བསྟན་པའི་ཆོ་འཕྲུལ་གྱིས་སམ། ཡང་ན་རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་ཀུན་ཏུ་བསྟན་པས་སམ།
en: These methods include teaching logic, inspiring those who are careless, uplifting those who are weary, inspiring them toward genuine accomplishment, speaking harshly, talking sweetly, using artisanship or arts to show what accords with the Dharma, displaying a body that is born pure, revealing miracles through miraculous displays, and demonstrating both the revealing of miracles that are shown to all and indirect miracles.

source: དེ་ལྟ་བུའི་ཚུལ་གྱི་ཐབས་ལ་མཁས་པའི་སྦྱོར་བ་ཚད་མེད་པ་དག་གིས་སེམས་ཅན་ཚད་མེད་པ་དག་འདུལ་བའོ། །
en: Through such endless applications of skillful means, limitless beings are tamed.

source: རིགས་ཀྱི་བུ་དེ་ལ་དཀོན་མཆོག་གི་ཆེ་བ་ཉིད་དཔག་ཏུ་མེད་པ་ནི་རྣམ་པ་གསུམ་སྟེ།
en: 8. “Noble son, the limitless greatness of the Jewels is threefold:

source: སངས་རྒྱས་དཀོན་མཆོག་གི་ཆེ་བ་ཉིད་དཔག་ཏུ་མེད་པ་དང་།
en: the limitless greatness of the Jewel of the Buddha,

source: ཆོས་དཀོན་མཆོག་གི་ཆེ་བ་ཉིད་དཔག་ཏུ་མེད་པ་དང་།
en: the limitless greatness of the Jewel of the Dharma, and

source: དགེ་འདུན་དཀོན་མཆོག་གི་ཆེ་བ་ཉིད་དཔག་ཏུ་མེད་པའོ། །
en: the limitless greatness of the Jewel of the Saṅgha.

source: དེ་ལ་སངས་རྒྱས་དཀོན་མཆོག་གི་ཆེ་བ་ཉིད་དཔག་ཏུ་མེད་པ་ནི་རྣམ་པ་བདུན་དུ་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: “The limitless greatness of the Jewel of the Buddha should be understood in seven ways.

source: མངོན་པར་ཤེས་པ་ཆེན་པོ་བརྙེས་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བ་དང་།
en: The Thus-Gone One is a master of all phenomena because he has attained great supernatural abilities.

source: མི་གནས་པའི་མྱ་ངན་ལས་འདས་པ་དང་། རྣམ་པར་གྲོལ་བའི་སྐུ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཆོས་ཀྱི་སྐུ་རྟག་པ་ཉིད་ཀྱི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཟད་མི་ཤེས་པ་དང་།
en: The body of the Thus-Gone One is inexhaustible because it is the body of nonabiding nirvāṇa and complete liberation as well as the permanent Dharma body.
